In [5]:
import pandas as pd

In [8]:
pd.read_excel('03_Pandas_reading_Excel.xlsx', sheet_name='people')

      name  age
0   rafael   15
1  gabriel   10

In [11]:
pd.read_excel('03_Pandas_reading_Excel.xlsx', sheet_name='marks')

      name  test  mark
0   rafael     1     7
1  gabriel     1     4
2   rafael     2     8
3  gabriel     2     9

In [12]:
dataMarks = pd.read_excel('03_Pandas_reading_Excel.xlsx', sheet_name='marks')

In [13]:
dataPeople = pd.read_excel('03_Pandas_reading_Excel.xlsx', sheet_name='people')

In [16]:
dataAll = dataMarks.set_index('name').join(dataPeople.set_index('name'))

In [17]:
dataAll

         test  mark  age
name
gabriel     1     4   10
gabriel     2     9   10
rafael      1     7   15
rafael      2     8   15

In [22]:
marks = dataAll.groupby('name').mark.mean()

In [23]:
marks

name
gabriel    6.5
rafael     7.5
Name: mark, dtype: float64

In [25]:
marks.to_excel('03_Pandas_reading_Excel_output.xlsx')